# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [1]:
# 記得先 Import 正確的套件

'''
Your Code
'''
import pandas as pd
import numpy  as np

In [2]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [9]:
'''
Your Code
'''
print(df.groupby("animal").age.mean())
df.sort_values(by=["age","visits"])
df["priority"].replace({"yes":True ,"no":False})

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [55]:
df=pd.DataFrame(np.random.random(size=(5, 3)))
df1 = pd.DataFrame(np.random.random(size=(5, 3)))
df2=pd.DataFrame(np.random.random(size=(5, 3)))

In [53]:
'''
Your Code
'''
for i in range(3):
    df1[i]=df1[i]-df1[i].mean()
    df2[i]=df2[i]-df2.mean(axis=1)

In [52]:
'''
Your Code
'''

0    0.867282
1    0.328118
2    0.587609
3    0.019057
4    0.411374
Name: 1, dtype: float64

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [54]:
df

          0         1         2
0  0.247070 -0.342082 -0.128691
1 -0.021317 -0.195247 -0.321142
2  0.109431  0.228975 -0.126819
3 -0.363920  0.113172  0.281393
4  0.028736  0.195182  0.295260

In [62]:
'''
Your Code
'''
pd.Series.idxmin(df.sum(axis=1))+1

2

In [66]:
'''
Your Code
'''
pd.Series.idxmin(df.sum(axis=0))+1

0    3.096260
1    1.226847
2    2.275904
dtype: float64